#+property: header-args:python :session bbr :async yes :kernel lightnet-dev

* 学習
  
  #+name: init-lr
  : 0.0001
  #+name: epochs
  : 25

  #+begin_src python :exports both :var init_lr=init-lr epochs=epochs
    model = VGG16ObjectDetector()
    for part, modules in model.named_children():
        if part == "extractor":
            grad = False
        else:
            grad = True

        for param in modules.parameters():
            param.requrires_grad_(grad)
    device = torch.device("cuda:0" if torch.cuda.is_available() else "cpu")
    model.to(device)

    optim = nn.Adam(model.parameters(), lr=init_lr)
    criterion = nn.MSELoss()

    for epoch in range(epochs):
        losses = []
        for data, target in bdd_train_loader:
            inp = data.to(device)

            optim.zero_grad()

            outputs = model(inp)
            loss = criterion(outputs, target)
            loss.backward()
            optim.step()

        if (epoch + 1) % p_num == 0:
            print(f"Epoch {epoch + 1} Loss: {sum(loss) / len(loss)}")
  #+end_src

  #+RESULTS:
  :RESULTS:
  # [goto error]
  #+begin_example

    AttributeErrorTraceback (most recent call last)
    <ipython-input-13-642406428ca2> in <module>
          1 init_lr=0.0001
          2 epochs=25
    ----> 3 model = VGG16ObjectDetector()
          4 for part, modules in model.named_children():
          5     if part == "extractor":

    <ipython-input-4-644046ff3df1> in __init__(self)
          4 
          5         self.extractor = models.vgg16(pretrained=True)
    ----> 6         self.extractor.classifier = nn.Sequential()
          7 
          8         self.bbox = nn.Sequential(

    AttributeError: 'str' object has no attribute 'Sequential'
  #+end_example
  :END:

